const bubbleText = `#Пузырьковая сортировка\n
Самый известный и самый простой алгоритм сортировки.\n
Последовательно сравниваются значения соседних элементов. В случае, если предыдущий оказывается больше последующего (при сортировке по возрастанию), то элементы меняются местами.\n
В результате, элемент всплывает, словно пузырёк, или тонет как топор (при сортировке по убыванию). Но этот алгоритм не назвали @y“Сортировка топором”@, потому что слово @y“топор”@ звучит мрачно, не то что лёгкое и весёлое слово “пузырёк”.\n
Алгоритм считается учебным и в здравом уме на практике не применяется.\n
$СЛОЖНОСТЬ ПО ВРЕМЕНИ\n
@rХудшее время:@ O(n2)\n
@yСреднее время:@ O(n2)\n
@gЛучшее время:@ O(n)\n
@wЗатраты памяти:@ O(1)\n
`;


//    TEXT MARKUP    //
///////////////////////
// #TITLE            //
// $SUBTITLE         //
// \nPARAGRAPH       //
// @r - RED QUOTE    //
// @y - YELLOW QUOTE //
// @g - GREEN QUOTE  //
// @w - WHITE QUOTE  //
///////////////////////
