const bubbleText = `#Пузыриковая сортировка#&Самый известный и самый простой алгоритм сортировки.&
Последовательно сравниваются значения соседних элементов. В случае, если предыдущий оказывается больше последующего (при сортировке по возрастанию), то элементы меняются местами.
В результате, элемент всплывает, словно пузырёк, или тонет как топор (при сортировке по убыванию). Но этот алгоритм не назвали “Сортировка топором”, потому что слово “топор” звучит мрачно, не то что лёгкое и весёлое слово “пузырёк”.
Алгоритм считается учебным и в здравом уме на практике не применяется.
 
СЛОЖНОСТЬ ПО ВРЕМЕНИ
Худшее время: O(n2)
Среднее время: O(n2)
Лучшее время: O(n)
Затраты памяти: O(1)
`;

export { bubbleText };


// #TITLE#
// &PARAGRAPH&
// @red
// @yel
// @gre
// @whi
// 